<?php

namespace app\controller;

class Notices
{
    public function Msg()
    {
        $data = [
            "State" => 1,
            "data" => [
                [
                    "id" => "c3dc7d3429d042eaaba65d4da8fb7314",
                    "popup" => 0,
                    "date" => "2024-05-07 19:30:14",
                    "content" => "通知：新澳门六合彩三全中包含（12*16*35，\n23*41*48，\n13*24*45，\n07*23*45，\n24*35*45，\n12*23*35）的所有注单注销，会员不得有任何异议，谢谢合作。"
                ],
                [
                    "id" => "496cbe67190248089a633af5f7cef547",
                    "popup" => 0,
                    "date" => "2024-05-07 15:45:20",
                    "content" => "通知！即日起新澳门六合彩，特马封盘时间调整为21:15  非特封盘时间调整为20:00，  如有变动另行通知，外面有传言,新澳门开奖号码有可能会开出多个版本,万一出现开奖号码开出多个版本,一切以盘口开出的号码为准,如有疑问请各位会员不要下注!!!!"
                ],
                [
                    "id" => "b21d686df09f41258bba65da652ebc4a",
                    "popup" => 0,
                    "date" => "2024-05-06 19:09:33",
                    "content" => "紧急通知：\n由于开奖方系统升级无法投注，为保障并维护各级代理的利益，避免被收割，166系统新澳门六合彩今日暂停投注，并删除已下注订单，具体开启时间待定。其余彩种均可正常投注。还请知悉并互相转告，给您造成不便敬请谅解！"
                ]
            ]
        ];
        return json($data);
    }
}